/* Описание файлов
	init.js - Все, что происходит автоматически при загрузке приложения - рендер, загрузка данных находится в этом файле 
	
	my-app.js - В идеале он должен содержать методы и собирать модули
	
	cartoons.js - Отвечает за загрузку видеозаписей и все остальное, что происходит со страницей мультфильмов
	
	login.js - Отвечаетза login, log out, и регистрацию пользователей
	
	feedback.js - рекомендации от пользователей
	
	globalvars.js - глобальные переменные, кэш
*/

/*Список методов

	*shortAjax(url,data,onSuccess) - Этот замечательный метод описан Великим и Ужасным(нет) Валерой, он позволяет нам не писать полную версию ajax запроса каждый раз, а лишь вызывать эту функцию, в которой url - полный адрес сервера, data - данные, которые отправляются на сервер, onSuccess - функция, которую следует выполнять при успешном получении ответа с сервера
	
*/

/*Задачи для Валеры:
	1)Переписать php файлы сервера, чтобы было удобнее следить за  модулями
	2)КУУУУУУУУУУКИ МОЖНО ИЗМЕНЯТЬ ЧЕРЕЗ БРАУЗЕР
	3)С логином и тд - очистка инпута,ну ты понял
*/

/*Задачи для Кирилла:
	1)Новости
*/