/* ќписание файлов на стороне клиента
	init.js - ¬се, что происходит автоматически при загрузке приложени¤ - рендер, загрузка данных находитс¤ в этом файле 
	
	my-app.js - ¬ идеале он должен содержать методы и собирать модули
	
	cartoons.js - ќтвечает за загрузку видеозаписей и все остальное, что происходит со страницей мультфильмов
	
	login.js - ќтвечаетза login, log out, и регистрацию пользователей
	
	feedback.js - рекомендации от пользователей
	
	globalvars.js - глобальные переменные, кэш
	
	cookie.js - отвечает за сохранение cookies в localStorage
	
	userOptions.js - отвечает за личный кабинет пользовател¤
	
	news.js - отрисовка списков категорий новостей и самих новостей в категори¤х
*/

/*
ќЅя«ј“≈Ћ№Ќќ ƒЋя ѕ–ќ„“≈Ќ»я
	–аспредел¤ть файлы по типу файлов на сервере, переименовать пути

*/

/* ќписание файлов на сервере

*/

/*—писок методов

	*ajax(url,data,onSuccess) - Ётот замечательный метод описан ¬еликим и ”жасным(нет) ¬алерой, он позвол¤ет нам не писать полную версию ajax запроса каждый раз, а лишь вызывать эту функцию, в которой url - полный адрес сервера, data - данные, которые отправл¤ютс¤ на сервер, onSuccess - функци¤, которую следует выполн¤ть при успешном получении ответа с сервера

*/